<template lang="pug">
.container.my-3
  h3 Описание приложения 
  p="Visual Fuzzy Control Language - приложение для моделирования систем нечеткой логики."
  | Возможности:
  ul.list-group
    li.list-group-item Моделирование системы нечеткой логики
    li.list-group-item Импортирование модели в формате FCL(ГОСТ Р МЭК 61131-7—2017)
    li.list-group-item Экспортирование модели в формате FCL(ГОСТ Р МЭК 61131-7—2017)
    li.list-group-item Экспортирование модели в формате TXT (без стандарта)
    li.list-group-item Вычисление значений выходных переменных по алгоритму Мамдани
  a(:href="$store.state.url+'/gost_r_mek.pdf'") Ссылка на ГОСТ Р МЭК 61131-7—2017
  br
  a(:href="$store.state.url+'/tipper.fcl'") Ссылка на образец файла с форматом FCL
  br
  a(href="https://jfuzzylogic.sourceforge.net/html/manual.html") Ссылка на библиотеку с описанием формата FCL в файле
  h4.my-4 Инструкция по использованию приложения
  | Вы можете загрузить свою модель на латинице в формате FCL или создать собственную модель.

  |Ниже описаны шаги по созданию модели нечеткой логики
  ul.list-group
    li.list-group-item 1. Добавление типа, которые включает задание названия.
    li.list-group-item 2. Добавление терма: задание имени, выбора функции принадлежности с последующим вводом ее параметров. 
    li.list-group-item 3. Добавление входных и выходных переменных.
      br
      | Для входных переменных: задание имени переменной, выбора типа, ввода значения.
      br
      | Для выходных переменных: задание имени переменной, выбора типа, метода дефаззификации, ввода значения по умолчанию.
    li.list-group-item 4. Добавление правил.
      br
      | Правило добавляет в конец списка. 
      | Правила автоматически получают свое название, которые можете изменить. 
      | Правило задается из условия, оператора и весового коэффициента. 
      | Условие состоит из переменной, оператора равенства, терма данного равенства.
      | Условия имеют одинаковую структуру с операторами, за исключением, 
      | что в условиях используются входные переменных, а операторах выходные.
    li.list-group-item 5. Выбора в блоке правил метода аккумуляции и активации. 
      br
      | По умолчанию для связи "и" используется минимум, а для "или" максимум.
    li.list-group-item 6. Получения значений для выходных переменных по нажатию на кнопку.
      br
      | Автоматически будут выведены графики функций принадлежности с найденным значением для последней выходной переменной.
    li.list-group-item 7. Для повторного использования созданной модели необходимо экспортировать ее в формате FCL.
      br
      | Экспортирование в формате TXT имеет немного другое оформление, которое немного легче воспринимается. 
      | Однако импортирование для данного формата не предусмотрено.
  h4.my-3 Пользовательский интерфейс
  | Пользовательский интерфейс разделен на несколько блоков: правила, типы, графики функций принадлежности, переменные.
  | Они имеют следующие элементы для пользовательского взаимодействия с системой:
  ul.list-group
    li.list-group-item 
      i.bi.bi-plus-square.text-success.h5.me-2
      |- кнопка для добавления. Создает модальное окно для добавления терма, переменной, типа. 
      | Добавляет в конец списка новое правило, условие и оператор правила.
    li.list-group-item 
      i.bi.bi-dash-square.text-danger.h5.me-2
      |- кнопка для удаления. Удаляет соответствующий элемент из списка.
    li.list-group-item 
      i.bi.bi-pencil-square.text-info.h5.me-2
      |- кнопка для редактирования. Позволяет редактировать соответствующий элемент в списке.
    li.list-group-item 
      i.bi.bi-arrow-down-square.text-muted.h5.me-2
      |- кнопка для скрытия. Дает возможность скрыть список.
    li.list-group-item
      .form-check.form-switch
        input.form-check-input#isColor1
        label.form-check-label.me-2(for="isColor1") Цветные графики
        | - переключатель серых графиков на разноцветные.
    li.list-group-item
      | Тип:
      label.mx-1(for='food') Еда
      input#food.form-check-input.h4.my-0.me-2(
              type="radio",
              style="min-width:24px",
            )
      | - переключатель для выбора типа или переменной, для отображения графиков функций принадлежности с заданным значением переменных.
    li.list-group-item
      button.btn.btn-success.me-2(type="button") 
        | Получить значения для выходных данных
      | - кнопка для получения значений выходных переменных
    li.list-group-item
      button.btn.btn-success.me-2(type="button") 
        | Импортировать fcl (только латинский алфавит)
      | - кнопка для загрузки из файла модели в формате FCL
    li.list-group-item
      button.btn.btn-success.me-2(type="button") 
        | Экспортировать в FCL
      | - кнопка для скачивания файла созданной модели в формате FCL 
    li.list-group-item
      button.btn.btn-success.me-2(type="button") 
        | Экспортировать в TXT
      | - кнопка для скачивания файла созданной модели в формате TXT
</template>

<script>
export default {
  name: "AboutComponents"
}
</script>

<style scoped>

</style>